//RCPUT01 JOB   NOTIFY=&SYSUID.
//*
//*
//*-------------------------------------------------------------------
//*  MEASURE:
//*           CPUTIME2      CPU=MIC     SAVE-AREA
//*           ZCPUTIME      CPU=MIC  NO SAVE-AREA
//*           CPUTIME9      CPU=ECT  NO SAVE-AREA HARDWARE ASSISTED
//*-------------------------------------------------------------------
//RACE     EXEC PGM=CPUT01,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=Z08115.DINO.LOADLIB
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
