//RNODLIT JOB                                                         
//*                                                                   
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM                                                  
//*-------------------------------------------------------------------
//NODLIT   EXEC PGM=CNODLIT                                           
//STEPLIB  DD DISP=SHR,DSN=Z08115.IBM.TIMEUSED.LOADLIB                
//SYSPUNCH DD SYSOUT=*                                                
//SYSOUT   DD SYSOUT=*                                                
